Repository: hackinscience/hkis-exercises
Catalog: locale/*/LC_MESSAGES/check.po
Languages: fr

source: Wrong answer while testing `{thing}`
fr: Erreur trouvée en testant `{thing}`

source: Got:
fr: J'ai eu :

source: Expected:
fr: J'attendais :

source: Beware: bencoded dicts keys should be lexicographically ordered.
fr: Attention : les clefs des dictionnaires doivent être ordonnées lexicographiquement par `bencode`.

source: `bencode`/`bdecode` is not an easy one, but you owned it, congrats!
fr: `bencode`/`bdecode` n'est vraiment pas un exercice facile, mais tu as réussi, bravo !

source: I called your program with: `{argv}` so I expected a usage line, but got:
fr: J'ai appelé ton programme avec : `{argv}` je m'attendais donc à obtenir la ligne d'aide, mais j'ai eu :

source: With no parameter, I expected your program to print the usage line, you printed nothing.
fr: Sans paramètres, je m'attendais à ce que ton programme affiche la ligne d'aide, mais il n'a rien affiché.

source: (Did you forgot to call your function? I'm asking for a program, not a function in this exercise).
fr: (As-tu oublié d'appeler la fonction `print` ? Attention, je demande un programme, pas juste une fonction, dans cet exercice.)

source: With no parameter, I expected your program to print the usage line, but I got:
fr: Sans paramètres, je m'attendais à ce que ton programme affiche la ligne d'aide, mais il n'a rien affiché.

source: Your code printed nothing. I expected to get the Github API response.
fr: Votre code n'affiche rien. Je m'attends à avoir une réponse de l'API Github.

source: I am time traveling to a friday the 13th ({at}), just to check your code…
fr: Je pars voyager dans le temps, (à {at}, un vendredi 13), juste pour vérifier ton code…

source: I am time traveling to random day ({at}), just to check your code….
fr: Je pars voyager dans le temps (j'ai pris une date au hasard, je suis tombé sur {at}), juste pour vérifier ton code…

source: Your function is expected to return a string of the following format: YYYY-MM-DD.
fr: Ta fonction devrait renvoyer une chaîne de caractères au format : `YYYY-MM-DD`.

source: In the case your function is executed during a friday the 13th, it's expected to return the current friday the 13th, but you returned another one.
fr: Dans le cas bien particulier où ta fonction est exécutée un vendredi 13, elle doit renvoyer le vendredi 13 actuel, mais elle en donne un autre.

source: Looks like you found a friday the 13th! But not the first one right after {at} (which is {next}).
fr: C'est bien un vendredi 13 ! Mais malheureusement ce n'est pas le premier après {at} (qui est {next}).

source: It does not looks like a friday the 13th!
fr: Hum… ça ne ressemble pas à un vendredi 13 ☹

source: What a chance, you're doing this exercise on a friday the 13th ☺
fr: C'est votre jour de chance ! Vous faites cet exercice alors qu'on *est* vendredi 13 !

source: You wrote no code (in the black area, which is a code editor). You should write a line of code which prints `Hello world!` when executed, if you really don't know how to start, you should first read the [tutorial](https://docs.python.org/3/tutorial/).
fr: Vous n'avez pas écrit de code (dans l'éditeur de code, noir, au milieu). Vous devriez écrire une ligne de code qui affiche `Hello world!`, mais si vous ne savez vraiment pas par où commencer, commencez par lire le [tuto](https://docs.python.org/fr/3/tutorial/).

source: You need to use the [print](https://docs.python.org/3/library/functions.html#print) function in order to make Python print something.
fr: Tu dois utiliser la fonction [print](https://docs.python.org/fr/3/library/functions.html#print) pour faire afficher quelque chose à Python.

source: "Hello world!" is a string, in Python strings should be enclosed in quotes or double quotes. See the [strings tutorial]( https://docs.python.org/3/tutorial/introduction.html#strings)
fr: « Hello world! » est une chaîne de caractères. En Python, les chaînes doivent être entouré de guillemets (ou de guillemets simples). Jettez un œil au tutoriel sur les [chaînes de caractères](https://docs.python.org/fr/3/tutorial/introduction.html#strings).

source: You're not in an [interactive Python interpreter]( https://docs.python.org/3/tutorial/interpreter.html#interactive-mode), your code is tested in a file, so there is no implicit print here. You have to use the [print](https://docs.python.org/3/library/functions.html#print) function.
fr: Vous n'êtes pas dans un [interpréteur interactif](https://docs.python.org/fr/3/tutorial/interpreter.html#interactive-mode) votre code est testé dans un fichier, il n'y a donc pas de `print` implicite ici. Vous devez utiliser la fonction [print](https://docs.python.org/fr/3/library/functions.html#print).

source: You should print "Hello World!", not something else to validate this exercise.
fr: Vous devez afficher « Hello World! », rien d'autre, pour valider cet exercice.

source: You printed nothing :(
fr: Votre code n'affiche rien :(

source: You printed:
fr: Votre code affiche :

source: (got nothing)
fr: (je n'ai rien eu)

source: You printed nothing!
fr: Votre code n'affiche rien :(

source: You printed the example, please print the current date.
fr: Vous afficher la date de l'exemple ! Affichez plutôt la date actuelle.

source: A good way to import the datetime class from the datetime module is: from datetime import datetime
fr: Un bon moyen d'importer la classe `datetime` du module `datetime` est : :::python from datetime import datetime

source: I expect it to be in a single line, got:
fr: Je m'attendait à un résultat sur une seule ligne, j'ai eu :

source: The date seems wrong, I need the current date.
fr: La date ne semble pas être la bonne, j'aimerai la date d'aujourd'hui.

source: Your code prints:
fr: Votre code affiche :

source: The date format seems wrong.
fr: Le format de la date ne semble pas bon.

source: It should start with 'Today is'.
fr: La date devrait commencer par `Today is`.

source: I expected to see 'and it is' between the date and the hour.
fr: Je m'attendais à voir `and it is` entre la date et l'heure.

source: The date part is not correct.
fr: La partie de la date n'est pas correcte.

source: Expected the format: `YYYY-MM-DD`.
fr: Le format attendu est: `YYYY-MM-DD`.

source: The hour part is not correct.
fr: La partie de l'heure n'est pas correcte.

source: Expected the format: `HH:MM:SS`.
fr: Le format attendu est: `HH:MM:SS`.

source: You printed odd numbers, I need even numbers.
fr: Tu affiche des nombres impairs, je voulais les nombres pairs.

source: I tried `print_even_numbers({start}, {stop})` and it printed nothing, did you forgot to call the [print](https://docs.python.org/3/library/functions.html#print) function?
fr: J'ai appelé `print_even_numbers({start}, {stop})`, mais elle n'a rien affiché, as-tu oublié d'appeler la fonction [print](https://docs.python.org/3/library/functions.html#print) ?

source: You need to put a single number per line.
fr: N'affiche qu'un nombre par ligne.

source: One line {line}, you gave an **odd** number, I need **even** numbers:
fr: À la ligne {line}, tu donnes un nombre **impair**, je ne veux que des nombres **pairs**.

source: You displayed all numbers but one, but I need only [even](https://en.wikipedia.org/wiki/Parity_(mathematics)) numbers!
fr: Vous affichez tous les nombres, sauf un. L'exercice demande les nombres [pairs](https://fr.wikipedia.org/wiki/Parit%C3%A9_(arithm%C3%A9tique)) !

source: You displayed all numbers (in the right range), but I need only even numbers.
fr: Vous affichez tous les nombres (de la bonne intervalle), mais je ne veux que les nombres [pairs](https://fr.wikipedia.org/wiki/Parit%C3%A9_(arithm%C3%A9tique)).

source: You displayed all numbers, but I need only even numbers (and Python's range is half-open: start is included, stop is excluded!)
fr: Vous affichez tous les nombres, mais je ne veux les nombres [pairs](https://fr.wikipedia.org/wiki/Parit%C3%A9_(arithm%C3%A9tique)) (aussi, les intervalles (`range`) dans Python sont semi-ouvertes : le début est inclu, mais pas la fin !)

source: Python's range is half-open (start included, stop excluded).
fr: Les intervalles (`range`) dans Python sont semi-ouvertes : le début est inclu, mais pas la fin !"

source: I need one number per line
fr: N'affichez qu'un nombre par ligne.

source: Your function is expected to return a string.
fr: Votre fonction doit renvoyer une chaîne de caractères.
